app/controllers/crossreviewtop_controller.rb

SELECT "reviews".* FROM "reviews" ORDER BY title
---
  def index
    @reviews = Review.find_reviews_for_top