app/controllers/publishers_controller.rb

  def index
    @publishers = Publisher.all
---
SELECT "publishers".* FROM "publishers"

  def show
    @publisher = Publisher.find(params[:id])
---
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = 1 LIMIT 1

  def edit
    @publisher = Publisher.find(params[:id])
---
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = 2 LIMIT 1

  def create
    @publisher = Publisher.new(params[:publisher])

    respond_to do |format|
      if @publisher.save
---
INSERT INTO "publishers" ("name", "url", "created_at", "updated_at") VALUES ('アスキー・メディアワークス', 'http://www.asciimw.jp/', '2011-03-05 14:42:32.939890', '2011-03-05 14:42:32.939890')

  def update
    @publisher = Publisher.find(params[:id])
---
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = 2 LIMIT 1