app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 'logged_out' LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

INSERT INTO "users" ("name", "hashed_password", "salt", "twitter_id", "profile", "image_url", "blog_url", "created_at", "updated_at") VALUES ('ujtommy', 'a4fce1d2e6c2d30bb55e02b7c1a2c06dab9d6ba2', '21699431800.2457022287847379', 'ujtommy', 'ああああ', '', '', '2011-03-05 18:14:10.310333', '2011-03-05 18:14:10.310333')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "image_url" = 'aaa', "blog_url" = 'bbbb', "updated_at" = '2011-03-06 05:12:08.764148' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])